;
; Example locale file that converts all of the strings to their uppercase
; equivalent. If you want to make your own, copy this file to locale.ini and
; then edit it with the text editor of your choice.
;
; To make your own, replace each string to the right of an equal sign with
; the text that you want to appear in place of the string to the left of the
; equal sign.
;
; & may be used to optionally mark a menu string's access key.
;
; \t, followed by a string, may be used to optionally denote a menu string's
; short cut key. These are fixed right now so the only thing you can choose
; to do is either display them or not.
;

[&Game]
&Game=விளையாட்டு
&Load=ஏற்றவும்\tL
&Save=சேமி\tS
&Previous=முந்தைய\tP
&Next=அடுத்து\tN
Ran&dom=சீரற்ற\tD
N&umber...=எண்...\tU
&Restart=மறுதொடக்கம்\tR
Sol&ve=தீர்
E&xit=வெளியேறு

[&Difficulty]
&Difficulty=&சிரமம்
&Beginner=ஆரம்பம்\tB
&Easy=எளிது\tE
&Medium=நடுத்தர\tM
&Hard=கடினமான\tH
E&xtreme=தீவிர\tX
&Adjust...=சரிசெய்...\tA

[&View]
&View=பார்வை
&Check for Errors=&பிழைகளுக்குச் சரிபார்க்கவும்\tC
Possible &Values=சாத்தியமான மதிப்புகள்\tV
&Fonts...=&எழுத்துருக்கள்...\tF

[&Help]
&Help=உதவி
Play &Help=விளையாட உதவி\tF1
&About USB Sudoku=சுடுகோஉவபே பற்றி

[Statusbar]
Beginner=தொடக்கம்
Easy=எளிது
Medium=நடுத்தர
Hard=கடினமான
Extreme=தீவிர
%s (%d%% max) puzzle %d=%s (%d%% அதிகபட்சம்) புதிர் %d
Generating (%d solutions analyzed)...=உருவாக்குகிறது (%d தீர்வுகள் பகுப்பாயப்பட்டது)...
%s (%d%% max) puzzle %d (rated at %d%%)=%s (%d%% அதிகபட்சம்) புதிர் %d (%d%% என மதிப்பிடப்பட்டது)
%d cells done (%.1f%%) %d to go=%d பெட்டிகள் முடிந்தது (%.1f%%) %d செல்ல வேண்டும்
%s puzzle %d (rated at %d%%)=%s புதிர் %d (%d%% என மதிப்பிடப்பட்டது)
%s puzzle %d=%s புதிர் %d

[AboutDialog]
About USB Sudoku=சுடுகோஉவபே பற்றி
USB Sudoku Version 2=சுடுகோஉவபே பதிப்பு 2
All versions of MS Windows supported=MS Windows இன் அனைத்து பதிப்புகளும் ஆதரிக்கப்படுகின்றன
A very small executable for playing the original game of Sudoku. Created specifically for use from a USB stick drive. But usable from any file system device.=சுடோகுவின் அசல் விளையாட்டை விளையாடுவதற்கு மிகவும் சிறியது. யூ.எஸ்.பி ஸ்டிக் டிரைவிலிருந்து பயன்படுத்துவதற்காக பிரத்யேகமாக உருவாக்கப்பட்டது. ஆனால் எந்த கோப்பு முறைமை சாதனத்திலிருந்தும் பயன்படுத்தக்கூடியது.
USB Sudoku is "green." The registry is not used. No file system writes are made except when USB Sudoku is exited.=USB SUDOKU "பச்சை." பதிவேடு பயன்படுத்தப்படவில்லை. யூ.எஸ்.பி சுடோகு வெளியேறும் போது தவிர எந்த கோப்பு முறைமை எழுத்துகளும் உருவாக்கப்படவில்லை.
GPL'd solver and rater by Bill Dupree. A "heuristic" approach is used to rate the difficulty of each game. All generated games are guaranteed to have only one solution.=GPL'D SOLVER மற்றும் RATER by பில் DUPREE. ஒவ்வொரு விளையாட்டின் சிரமத்தையும் மதிப்பிடுவதற்கு "ஹீரிஸ்டிக்" அணுகுமுறை பயன்படுத்தப்படுகிறது. அனைத்து உருவாக்கப்படும் கேம்களும் ஒரே ஒரு தீர்வைக் கொண்டிருப்பது உறுதி.
Free (GPL'd) and available at sourceforge.net.=இலவசம் (GPL'D) மற்றும் SOURCEFORGE.NET இல் கிடைக்கும்.
Packed with UPX.=UPX உடன் நிரம்பியுள்ளது.

[DifficultyDialog]
&Beginner Min:=தொடக்கம் குறைந்தபட்சம்:
&Beginner Max:=தொடக்கம் அதிகபட்சம்:
&Easy Max:=எளிது அதிகபட்சம்:
&Medium Max:=நடுத்தர அதிகபட்சம்:
&Hard Max:=கடினமான அதிகபட்சம்:
E&xtreme Max:=E&XTREME அதிகபட்சம்:
&Reset to defaults=&இயல்புநிலைகளுக்கு மீட்டமை

[GameNumberDialog]
Game Number=கேம் எண்
&Number:=&எண்:
Enter a value between 1 and 9,999,999 inclusive, to play a specific game number.=குறிப்பிட்ட கேம் எண்ணை விளையாட, 1 முதல் 9,999,999 உள்ளடக்கிய மதிப்பை உள்ளிடவும்.
Enter 0 to play a randomly selected game.=தேர்தலாக தேர்ந்தெடுக்கப்பட்ட விளையாட்டை விளையாட 0 ஐ உள்ளிடவும்.
OK=சரி
Cancel=ரத்துசெய்

[HelpDialog]
USB Sudoku Help=சுடுகோஉவபே உதவி
Under Construction.=கட்டுமானத்தின் கீழ்
Please see the included readme.txt file for keyboard and mouse usage and how to customize the look.=கீபோர்டு மற்றும் மவுஸ் பயன்பாட்டிற்கான சேர்க்கப்பட்டுள்ள என்னைபடி.உரை கோப்பைப் பார்க்கவும் மற்றும் தோற்றத்தை எவ்வாறு தனிப்பயனாக்குவது.

[SelectNumberDialog]
&1=&ஒன்று
&2=&இரண்டு
&3=&மூன்று
&4=&நான்கு
&5=&ஐந்து
&6=&ஆறு
&7=&ஏழு
&8=&எட்டு
&9=&ஒன்பது
&0 (clear)=சுழி (தெளிவு)
&Show as possible=முடிந்தவரை காட்டு
&Remove as possible=முடிந்தவரை அகற்று
